import levenstein

async def response(arg): 
    if arg == levenstein.hardcode_words[0]: # venom

        link_to_watch = 'https://mu.lordfilm.in/film/1-Uzhasy/317-venom.html'
        link_to_watch_eng = 'https://inoriginal.online/films/1755-venom-2018.html'
        link = 'https://b1.filmpro.ru/c/555575.jpg'
          
        description = (
            f"<b>{levenstein.hardcode_words[0]}</b>\n\n"  
            "🧐Описание: <i>Что если в один прекрасный день в тебя вселяется существо-симбиот, которое наделяет тебя "
            "сверхчеловеческими способностями? Вот только Веном — симбиот совсем недобрый, и договориться с ним "
            "невозможно. Хотя нужно ли договариваться?.. Ведь в какой-то момент ты понимаешь, что быть плохим "
            "вовсе не так уж и плохо. Так даже веселее. В мире и так слишком много супергероев! Мы — Веном!</i>\n\n"
            "<b>✨Рейтинг:</b>📀КП 6.9, 💿IMDB 6.6\n\n"  
            "<b>Жанр:</b> Ужасы / Фантастика / Блокбастер / Боевик / Триллер\n\n"  
            f"👀<a href='{link_to_watch}'>Ссылка для просмотра</a>\n"  
            f"👀<a href='{link_to_watch_eng}'>Ссылка для просмотра на английском языке</a>"  
        )
        return description, link


    elif arg == levenstein.hardcode_words[1]: # остров собак

        link_to_watch = 'https://id3.lordfilm1.codes/40844-ostrov-sobak.html'
        link = 'https://b1.filmpro.ru/c/536184.jpg'

        description = (
            f"<b>{levenstein.hardcode_words[1]}</b>\n\n"  
            "🧐Описание: <i>История 12-летнего мальчика Атари Кобаяси, опекаемого коррумпированным мэром Кобаяши." 
            "Когда по Указу последнего все домашние собаки города Мегасаки изгоняются на громадную свалку,"
            "Атари в одиночку отправляется на миниатюрном летательном аппарате на мусорный остров,"
            "чтобы найти своего верного пса по прозвищу Спотс."
            "Там на острове вместе со стаей новых друзей-дворняг он начнет эпичное путешествие,"
            "которое решит будущую судьбу всей Префектуры. </i>\n\n"
            "<b>✨Рейтинг:</b>📀КП 8.11, 💿IMDB 7.8\n\n" 
            "<b>Жанр:</b> драма, комедия, фантастика, приключения, мультфильм\n\n"  
            f"👀<a href='{link_to_watch}'>Ссылка для просмотра</a>"
        )        
        return description, link


    elif arg == levenstein.hardcode_words[2]: # магия лунного света

        link_to_watch = 'https://lord-films.com/8766-smotret-magiya-lunnogo-sveta-film-2014-online.html'
        link = 'https://b1.filmpro.ru/c/256487.jpg'

        description = (
            f"<b>{levenstein.hardcode_words[2]}</b>\n\n"  
            "🧐Описание: <i>1928 год. Выдающийся иллюзионист по просьбе своего друга и коллеги"
            "приезжает на Лазурный Берег разоблачить молодую привлекательную шарлатанку,"
            "якобы умеющую вызывать духов умерших. Она очаровала богатого наследника"
            "и его мать-вдову, а это не устраивает других членов семьи.</i>\n\n"
            "<b>✨Рейтинг:</b>📀КП 7.0, 💿IMDB 6.5\n\n" 
            "<b>Жанр:</b> Комедия, Зарубежный, Мелодрама \n\n"  
            f"👀<a href='{link_to_watch}'>Ссылка для просмотра</a>"
        )        
        return description, link       

    

    
    elif arg == levenstein.hardcode_words[3]: # Мстители: война бесконечности

        link_to_watch = 'https://kino.erfilm.cfd/3670-mstiteli-vojna-beskonechnosti-hd.html'
        link_to_watch_eng = 'https://inoriginal.online/films/79-avengers-infinity-war-2018.html'
        link = 'https://b1.filmpro.ru/c/528084.jpg'

        description = (
            f"<b>{levenstein.hardcode_words[3]}</b>\n\n"  
            "🧐Описание: <i>В то время как отважные Мстители с союзниками продолжают стоять на страже,"
            "защищая людей от всех опасностей, из космического пространства возникает новая серьезная угроза – Танос."
            "Межгалактический злодей начал собирать Камни бесконечности – артефакты, обладающие невероятной мощью."
            "Если собрать 6 штук, то их сила позволит изменять реальность по желанию хозяина.</i>\n\n"
            "<b>✨Рейтинг:</b>📀КП 8.1, 💿IMDB 8.4\n\n" 
            "<b>Жанр:</b> Фильмы, Фильмы Marvel, Боевики, Приключения, Фантастика, Самые кассовые, Фильмы про супергероев \n\n"  
            f"👀<a href='{link_to_watch}'>Ссылка для просмотра</a>\n"
            f"👀<a href='{link_to_watch_eng}'>Ссылка для просмотра на английском языке</a>"  

            
        )                
        return description, link

    elif arg == levenstein.hardcode_words[4]: # город в котором меня нет

        link_to_watch = 'https://hd.9lordserials.xyz/6924-gorod-v-kotorom-menya-net.html'
        link = 'https://b1.filmpro.ru/c/575301.jpg'

        description = (
            f"<b>{levenstein.hardcode_words[4]}</b>\n\n"  
            "🧐Описание: <i>Жизнь мангаки нелегка. Тяжелый и кропотливый труд по достоинству вознаграждается в редких случаях."
            "Авторские работы, в которые были вложены душа и нравоучительный посыл, не всегда достигают сердец"
            "читателей. Однажды понять, что ты пустой и скучный человек, не способный на"
            "большее — самый большой страх в жизни мангаки</i>\n\n"
            "<b>✨Рейтинг:</b>📀КП 8.6, 💿IMDB 8.5\n\n" 
            "<b>Жанр:</b> Детектив, Детский, Драма, Приключения \n\n"  
            f"👀<a href='{link_to_watch}'>Ссылка для просмотра</a>"
        )           
        return description, link

    elif arg == levenstein.hardcode_words[5]: # как витька чеснок вез леху штыря в дом инвалидов

        link_to_watch = 'https://2.lord-film.pics/7325-kak-vitka-chesnok-vez-lehu-shtyrya-v-dom-invalidov-film-2017-28'
        link = 'https://b1.filmpro.ru/c/479618.jpg'

        description = (
            f"<b>{levenstein.hardcode_words[5]}</b>\n\n"  
            "🧐Описание: <i>Отечественная криминальная драма знакомит своего зрителя с Витькой Чесноком. Сейчас герою 27-мь лет, и к этому возрасту ему пришлось пережить не мало бед в своей жизни. У него не было возможности проводить весёлые выходные со своим родителями, лишь потому, что их у него не было. Он вырос в детдоме. На данный момент парень мечтает лишь о том, чтобы просто провести своё свободное время как можно дальше от ненавистной жены и сына, который по его мнению, уж очень мешает ему жить. По чистой случайности, получивший в детстве психологическую травму, наш герой встречает своего биологического отца-уголовника, а вместе с тем и калеку. </i>\n\n"
            "<b>✨Рейтинг:</b>📀КП 7.2, 💿IMDB 7.1\n\n" 
            "<b>Жанр:</b> Драма, Комедия, Криминал \n\n"  
            f"👀<a href='{link_to_watch}'>Ссылка для просмотра</a>"
        )                
        return description, link
    


    elif arg == levenstein.hardcode_words[6]: # Рататуй

        link_to_watch = 'https://002.lordfilmtv.click/462-smotret-onlayn-ratatuy-2-2023-besplatno-v-horoshem-kachestve-hd-720-1080.html'
        link_to_watch_eng = 'https://inoriginal.online/films/326-ratatouille-2007.html'
        link = 'https://b1.filmpro.ru/c/23222.jpg'
        

        description = (
            f"<b>{levenstein.hardcode_words[6]}</b>\n\n"  
            "🧐Описание: <i>Главное в сюжете: Маленький крысеныш всегда мечтал стать великим шеф-поваром, потому что однажды он просмотрел кулинарное шоу, где узнал, что великим кулинаром может стать кто угодно. Он загорелся идеей, поэтому пробрался на кухню одного из самых модных рестораном. Там он наткнулся на приготовление супа и даже помог сделать его намного вкуснее. Никто не видел крысенка, по крайней мере он так думал. Его заметил молодой парень. Которого взяли на работу в качестве уборщика. Крысеныш оказался в страшной опасности, но смог доказать, что он умеет готовить. Парень тоже всегда мечтал быть поваром, поэтому подумал, что крышеныш ему в этом поможет. </i>\n\n"
            "<b>✨Рейтинг:</b>📀КП 9.2, 💿IMDB 9.0\n\n" 
            "<b>Жанр:</b> Мультфильм, Фэнтези, Комедия, Семейный \n\n"  
            f"👀<a href='{link_to_watch}'>Ссылка для просмотра</a>\n"
            f"👀<a href='{link_to_watch_eng}'>Ссылка для просмотра на английском языке</a>"  

        )                  
        return description, link


    else:
        return 'to be cont...', '..inued'


    